{
  "ru": "До веб-разработки:\nОкончил Училище Культуры им. Львова. После учебы работал преподавателем по классу гитары в Детской Школе Искусств. Затем перешел в Дом Культуры на должность звукорежиссера — занимался звуком на мероприятиях, параллельно начал монтировать видео.\n\nВ этот же период начал писать музыку для аудиостоков (AudioJingle) — работал как композитор, музыка уходила на YouTube, телевидение, в СМИ. Конкуренция оказалась слишком высокой, направление осталось хобби.\n\nПосле Дома Культуры устроился верстальщиком в местную газету — делал полную верстку каждого выпуска. Через время вернулся в Дом Культуры, но уже как видеомонтажер. Параллельно брал заказы от местной Администрации: видеопроекты, заставки, ролики. Оформил самозанятость по двум направлениям — видеомонтаж и композитор.\n\nИз крупных проектов:\n\nПолное видеосопровождение праздника карельской культуры “Ома Ранда” (монтаж роликов с интеграцией 3D-объектов в Cinema 4D, аранжировка гимна)\n\nСоздание мультипликационной 3D-заставки для детской программы “Все обо всем”\n\nПуть в IT:\nНачал с сайта Code Basics, где прошел курсы по HTML и CSS. Потом оставил обучение на год из-за загруженности на основной работе. Через год вернулся к JavaScript на том же Code Basics, дальше ушел в самостоятельное обучение: YouTube, курсы, верстка с преподавателями.\n\nПробовал учиться в Rolling Scopes School — на тот момент навыков не хватало, поэтому сосредоточился на практике. Постепенно дошел до React, TypeScript, Zustand, Redux Toolkit. Параллельно решал задачи на Codewars.\n\nСейчас:\n530 решенных задач, ранг 3 kyu (топ 0.8%). В работе использую React, JavaScript, TypeScript, Zustand, Redux Toolkit, SCSS. Верстку и JS пишу самостоятельно. Интересуюсь вайбкодингом и работой с нейросетями.\n\nСтек:\nReact • JavaScript • TypeScript • Zustand • Redux Toolkit • SCSS • HTML • CSS • Git",
  
  "en": "Before Web Development:\nGraduated from the Lvov Cultural College. Worked as a guitar teacher at a Children's Art School. Later moved to the House of Culture as a sound engineer — handled sound for events and started editing videos on the side.\n\nDuring this period, began composing music for stock audio platforms (AudioJingle) — worked as a composer, music was used on YouTube, television, and other media. Competition turned out to be too high, so it remained a hobby.\n\nAfter the House of Culture, worked as a layout designer at a local newspaper — handled full layout for every issue. Later returned to the House of Culture as a video editor. Simultaneously took freelance projects from the local Administration: video projects, intros, promos. Registered as self-employed in two fields — video editing and composing.\n\nNotable projects:\n\nFull video production for the Karelian culture festival “Oma Randa” (editing videos with 3D integration in Cinema 4D, arranging the anthem)\n\nCreated an animated 3D intro for the children's show “Vse obo vsem”\n\nPath into IT:\nStarted with Code Basics, where I completed HTML and CSS courses. Then took a one-year break due to workload at my main job. A year later returned to JavaScript on the same platform, then continued with self-study: YouTube, courses, coding along with instructors.\n\nTried Rolling Scopes School — my skills weren't sufficient at the time, so I focused on practice. Gradually worked my way up to React, TypeScript, Zustand, Redux Toolkit. Simultaneously solved problems on Codewars.\n\nCurrently:\n530 solved problems, rank 3 kyu (top 0.8%). I work with React, JavaScript, TypeScript, Zustand, Redux Toolkit, SCSS. I handle layout and JavaScript independently. Interested in vibe coding and working with neural networks.\n\nTech Stack:\nReact • JavaScript • TypeScript • Zustand • Redux Toolkit • SCSS • HTML • CSS • Git"
}
