{
  "en": "I'm a Computer Science student at *SRM Institute of Science and Technology*. My passion lies in building user-friendly solutions that enhance overall user experiences. I am currently focused on React Native, Expo, Firebase, and React, leveraging these technologies to create responsive and functional applications. One of my ongoing projects is Rescue Paws, a mobile app designed to facilitate the rescue and adoption of stray and pet dogs. The app will soon be published on the Play Store and App Store, and it incorporates AI-driven features to guide users through the adoption process. In addition to app development, I've led the design and development of platforms like the GitHub Community SRM website, which serves as an all-in-one platform for the community. I've also organized and managed events such as hackathons and workshops, mentoring others in UI/UX and graphic design. I thrive in Agile Scrum environments and believe collaboration and teamwork are essential to delivering successful projects. I'm always eager to work on impactful projects that challenge me to grow while also contributing to meaningful outcomes. So, whether you're looking for a dedicated developer, a creative designer, or a collaborative team member, I'm here to help bring ideas to life. Let's connect and create innovative solutions together!", 
  "ru": "Я студент компьютерных наук в *SRM Institute of Science and Technology*. Моя страсть — создавать удобные решения, которые улучшают пользовательский опыт. В настоящее время я сосредоточен на React Native, Expo, Firebase и React, используя эти технологии для создания отзывчивых и функциональных приложений. Один из моих текущих проектов — Rescue Paws, мобильное приложение, предназначенное для помощи в спасении и усыновлении бездомных и домашних собак. Приложение скоро будет опубликовано в Play Store и App Store и включает функции на основе искусственного интеллекта, которые направляют пользователей через процесс усыновления. Помимо разработки приложений, я руководил дизайном и разработкой платформ, таких как веб-сайт GitHub Community SRM, который служит универсальной платформой для сообщества. Я также организовывал и управлял мероприятиями, такими как хакатоны и воркшопы, обучая других UI/UX и графическому дизайну. Я преуспеваю в средах Agile Scrum и считаю, что сотрудничество и командная работа необходимы для успешной реализации проектов. Я всегда стремлюсь работать над значимыми проектами, которые бросают мне вызов и способствуют моему росту, одновременно принося meaningful результаты. Так что, если вы ищете dedicated разработчика, креативного дизайнера или collaborative участника команды — я здесь, чтобы помочь воплотить идеи в жизнь. Давайте соединимся и создадим инновационные решения вместе!"
}